//state状态值 类似于组件中的data数据源
export default {
    num: 8,
    names: ['宋', '文', '弓', '虽'],
    count1: 10,
    count2: 20,
    count3: 30,
    count4: 40,
    count5: 50,
    news_details: [
      {
        news_id: 1,
        news_title: "震惊！郑州某男子每天起个大早是为了这个...",
        news_count: 1,
        news_con: "震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个...震惊！郑州某男子每天起个大早是为了这个..."
      },
      {
        news_id: 2,
        news_title: "99%的人都不知道的秘密！速看！",
        news_count: 2,
        news_con: "99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！99%的人都不知道的秘密！速看！"
      },
      {
        news_id: 3,
        news_title: "一位老人的九句话，终身受用,朋友圈都转疯了!!",
        news_count: 3,
        news_con: "一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!一位老人的九句话，终身受用,朋友圈都转疯了!!"
      },
      {
        news_id: 4,
        news_title: "人到了一定年龄，必须扔掉这四样东西...",
        news_count: 4,
        news_con: "人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西...人到了一定年龄，必须扔掉这四样东西..."
      },
      {
        news_id: 5,
        news_title: "外地人快把郑州人羡慕死了就因为这10件事··",
        news_count: 5,
        news_con: "外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··外地人快把郑州人羡慕死了就因为这10件事··"
      },
      {
        news_id: 6,
        news_title: "什么?海报居然还能这样设计???",
        news_count: 6,
        news_con: "什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???什么?海报居然还能这样设计???"
      },
      {
        news_id: 7,
        news_title: "人到了一定年龄，必须扔掉这四样东西...",
        news_count: 7,
        news_con: "万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!万万没想到，这样吃鸡蛋对身体竟然有害处!"
      }
    ],
    todos: [{
      text: "文弓虽1",
      vip: false
    },
    {
      text: "文弓虽2",
      vip: true
    },
    {
      text: "文弓虽3",
      vip: false
    },
    {
      text: "文弓虽4",
      vip: true
    },
    {
      text: "文弓虽5",
      vip: false
    }
    ]
  };